<!DOCTYPE html>
<html lang="en-us">
    <head><meta charset='utf-8'>
<meta name='viewport' content='width=device-width, initial-scale=1'><meta name='description' content='Behind Closed Doors'><title>Exploring Encrypted Multifiles: A Technical Overview</title>

<link rel='canonical' href='https://tohka.us/p/exploring-encrypted-multifiles-a-technical-overview/'>

<link rel="stylesheet" href="/scss/style.min.css"><meta property='og:title' content='Exploring Encrypted Multifiles: A Technical Overview'>
<meta property='og:description' content='Behind Closed Doors'>
<meta property='og:url' content='https://tohka.us/p/exploring-encrypted-multifiles-a-technical-overview/'>
<meta property='og:site_name' content='Daniel&#39;s Blog'>
<meta property='og:type' content='article'><meta property='article:section' content='Post' /><meta property='article:tag' content='reverse-engineering' /><meta property='article:published_time' content='2021-02-27T00:00:00&#43;00:00'/><meta property='article:modified_time' content='2021-02-27T00:00:00&#43;00:00'/><meta property='og:image' content='https://tohka.us/p/exploring-encrypted-multifiles-a-technical-overview/persona.png' />
<meta name="twitter:title" content="Exploring Encrypted Multifiles: A Technical Overview">
<meta name="twitter:description" content="Behind Closed Doors"><meta name="twitter:card" content="summary_large_image">

    <span class="n">printf</span><span class="p">(</span><span class="s">&#34;TestClass memory:</span><span class="se">\n\n</span><span class="s">&#34;</span><span class="p">);</span>

    <span class="kt">unsigned</span> <span class="kt">char</span> <span class="o">*</span><span class="n">memory</span> <span class="o">=</span> <span class="p">(</span><span class="kt">unsigned</span> <span class="kt">char</span> <span class="o">*</span><span class="p">)</span> <span class="n">test</span><span class="p">;</span>

    <span class="k">for</span> <span class="p">(</span><span class="kt">int</span> <span class="n">i</span> <span class="o">=</span> <span class="mi">0</span><span class="p">;</span> <span class="n">i</span> <span class="o">&lt;</span> <span class="k">sizeof</span><span class="p">(</span><span class="o">*</span><span class="n">test</span><span class="p">);</span> <span class="o">++</span><span class="n">i</span><span class="p">)</span> <span class="p">{</span>
        <span class="n">printf</span><span class="p">(</span><span class="s">&#34;%u &#34;</span><span class="p">,</span> <span class="n">memory</span><span class="p">[</span><span class="n">i</span><span class="p">]);</span>
    <span class="p">}</span>

    <span class="n">printf</span><span class="p">(</span><span class="s">&#34;</span><span class="se">\n</span><span class="s">&#34;</span><span class="p">);</span>
    <span class="k">return</span> <span class="mi">0</span><span class="p">;</span>
<span class="p">}</span>
</code></pre></div><p>Save the code provided above as <code>classTest.cxx</code>. Note how our new custom class is called <code>TestClass</code>, and it has three class members: <code>first</code>, <code>second</code> and <code>third</code>, all three being <code>int</code> types (4 byte numbers). The <code>first</code> class member will be set to <code>4</code>, the <code>second</code> to <code>2</code>, and the <code>third</code> to <code>9</code>.</p>
<p>Open your <code>x64 Native Tools Command Prompt for VS 2019</code>, and compile <code>classTest.cxx</code> with the following command:</p>
<p><code>cl /d1reportAllClassLayout classTest.cxx</code></p>
<p>Note that we&rsquo;re using the <code>/d1reportAllClassLayout</code> command line option of <code>cl.exe</code>, the official Microsoft Visual C++ compiler. This is an <em>undocumented feature</em> of the Visual C++ compiler front-end, meaning that it is not supported, and not advertised by Microsoft in any way or capacity.<sup id="fnref:8"><a href="#fn:8" class="footnote-ref" role="doc-noteref">8</a></sup> Regardless, it is <strong>very</strong> useful for engineers who work with memory dumps on a daily basis, as using this command line option allows you to see the entire memory layout of all classes encountered during compilation.</p>
<p>Not only will <code>cl</code> compile our program into an executable called <code>classText.exe</code>, but it will also share with us the <strong>memory layout of TestClass, our custom class</strong>:</p>
<pre><code>class TestClass size(12):
        +---
 0      | first
 4      | second
 8      | third
        +---
</code></pre><p>Wow! Is it really that simple? Yes, it is. More complicated classes will have automatic alignment adjustments, but that is of little concern to us: the important bits are the <strong>offsets</strong>, the numbers that appear in the first column of the memory layout.</p>
<p>For example, if you know that a class begins at, for example, 0x00005210 in your memory, and you want to read the memory of the class member named <code>second</code>, then first, you&rsquo;ll need to begin at the memory address 0x00005210, skip 4 bytes (equal to the <em>offset</em> of <code>second</code>) to 0x00005214, and read 4 bytes at that address (equal to the <em>size</em> of <code>second</code>, which is an int, a 4 byte number).</p>
<p>Since our class instance is allocated using the <code>new</code> operator, the class instance is saved in the <code>heap</code>, a special area of the memory dedicated to long-living objects. It is <strong>not lost</strong> when the function that created the class instance ends. Multifiles are allocated in Panda3D in exactly the same way, so our access to this data is guaranteed.</p>
<p>Run <code>classText.exe</code> in your Command Prompt for the following output:</p>
<pre><code>Size of TestClass instance: 12
TestClass memory:

4 0 0 0 2 0 0 0 9 0 0 0
</code></pre><p>This means that our compiler was right: TestClass&rsquo;s size is indeed 12, the first 4 bytes are used by the class member named <code>first</code> (set to 4), the second 4 bytes are used by the class member named <code>second</code> (set to 2), and the last 4 bytes are used by the class member named <code>third</code> (set to 9).</p>
<h3 id="stdstring-internals">std::string internals</h3>
<p>Before we go any further, we must talk about <code>std::string</code>. This container is going to be crucial to our research from now on. Each <code>std::string</code> stores characters. For example, if you want to represent the following text: <em>&ldquo;I love my internet friends&rdquo;</em>, you would need to store this data in an <code>std::string</code>.</p>
<p>An <code>std::string</code> is a data container that always takes up <code>32</code> bytes of memory in our MSVC 2019 x64 environment. But how come it always takes up <strong>32</strong> bytes of memory? <em>&ldquo;I love my internet friends&rdquo;</em> should only be 26 bytes long, no? What if I want to store something longer, like <em>&ldquo;Great expectations of sun rays and bright days&rdquo;</em>? That is 46 bytes long, how come it fits in a <code>32</code> byte long container?</p>
<p><strong>It turns out that <code>std::string</code> is a very clever data container. <em>It acts differently based on how long your string is.</em></strong></p>
<p><strong>If your <code>std::string</code> is shorter than or equal to 16 characters, then the first 16 characters are used to store the string <em>as-is</em>, while index 16 to index 24 is used to store a 8 byte long length.</strong> This is called Small String Optimization, and is yet another undocumented MSVC feature. All compilers implement some sort of Small String Optimization, but these implementations differ between compilers. There is almost no information on MSVC&rsquo;s SSO on the internet, but it&rsquo;s fairly easy to figure the format out.</p>
<p>For example, let&rsquo;s encode the following string: <code>Blood of Villain</code>. Encoded as <code>std::string</code>, <code>Blood of Villain</code> manifests in the memory as such:</p>
<table>
<thead>
<tr>
<th>0</th>
<th>1</th>
<th>2</th>
<th>3</th>
<th>4</th>
<th>5</th>
<th>6</th>
<th>7</th>
<th>8</th>
<th>9</th>
<th>10</th>
<th>11</th>
<th>12</th>
<th>13</th>
<th>14</th>
<th>15</th>
<th>16</th>
<th>17</th>
<th>18</th>
<th>19</th>
<th>20&hellip;</th>
</tr>
</thead>
<tbody>
<tr>
<td>B</td>
<td>l</td>
<td>o</td>
<td>o</td>
<td>d</td>
<td></td>
<td>o</td>
<td>f</td>
<td></td>
<td>V</td>
<td>i</td>
<td>l</td>
<td>l</td>
<td>a</td>
<td>i</td>
<td>n</td>
<td>0x10</td>
<td>0x00</td>
<td>0x00</td>
<td>0x00</td>
<td>0x00</td>
</tr>
</tbody>
</table>
<p>The first 16 characters are used to store the string, while the bytes from <code>16</code> to <code>24</code> are used to store the length, which is simply <code>0x10</code>, or <code>16</code> in this case.</p>
<p><strong>HOWEVER, if your <code>std::string</code> is longer than 16 characters, then the first 8 characters are used to store a pointer to the actual string data. Your ACTUAL string data will be saved elsewhere in the memory. The length of the string is still saved between the 16th and 24th indices.</strong></p>
<p>What happens if we encode the following string: <code>We are long strings</code>? Our <code>std::string</code> might look something like this:</p>
<table>
<thead>
<tr>
<th>0</th>
<th>1</th>
<th>2</th>
<th>3</th>
<th>4</th>
<th>5</th>
<th>6</th>
<th>7</th>
<th>&hellip;</th>
<th>16</th>
<th>17</th>
<th>18</th>
<th>19</th>
<th>20&hellip;</th>
</tr>
</thead>
<tbody>
<tr>
<td>0x00</td>
<td>0x00</td>
<td>0x00</td>
<td>0x00</td>
<td>0x43</td>
<td>0x50</td>
<td>0xAB</td>
<td>0xEF</td>
<td>&hellip;</td>
<td>0x13</td>
<td>0x00</td>
<td>0x00</td>
<td>0x00</td>
<td>0x00</td>
</tr>
</tbody>
</table>
<p>You might&rsquo;ve noticed that the first 16 characters no longer represent ASCII data. In fact, the first 8 bytes constitute a pointer. Let&rsquo;s head to <code>0x000000004350ABEF</code>, the 64-bit memory address encoded in the first 8 bytes of this <code>std::string</code>, and read <code>0x13</code> characters (19 characters, equal to the length of <code>We are long strings</code>.) The exact value at this address is <code>We are long strings</code>!</p>
<h3 id="the-multifile-memory-layout">The Multifile memory layout</h3>
<p>Now that we&rsquo;ve learned how to figure out a class&rsquo;s memory layout, let&rsquo;s use our newfound knowledge on the <code>multifile.cxx</code> file. Our target is the <code>Multifile</code> class! Execute the following command in <code>panda3d/panda/src/express</code>:</p>
<p><code>cl /d1reportAllClassLayout multifile.cxx -I../../../built_x64/include &gt; classes.txt</code></p>
<p>This will save a LOT of class layouts to a file called <code>classes.txt</code>. Open <code>classes.txt</code> and search for <code>class Multifile size</code>.</p>
<h4 id="multifile-layout">Multifile layout</h4>
<pre><code>class Multifile	size(1704):
	+---
 0	| +--- (base class ReferenceCount)
 0	| | {vfptr}
 8	| | +--- (base class MemoryBase)
	| | +---
 8	| | _ref_count
16	| | _weak_list
	| +---
24	| ?$ov_set@PEAVSubfile@Multifile@@V?$IndirectLess@VSubfile@Multifile@@@@V?$pvector@PEAVSubfile@Multifile@@@@ _subfiles
64	| ?$pvector@PEAVSubfile@Multifile@@ _new_subfiles
96	| ?$pvector@PEAVSubfile@Multifile@@ _removed_subfiles
128	| ?$pvector@PEAVSubfile@Multifile@@ _cert_special
160	| ?$pvector@V?$pvector@VCertRecord@Multifile@@@@ _signatures
192	| ?$fpos@U_Mbstatet@@ _offset
216	| _read
224	| _write
232	| _owns_stream
  	| &lt;alignment member&gt; (size=7)
240	| ?$fpos@U_Mbstatet@@ _next_index
264	| ?$fpos@U_Mbstatet@@ _last_index
288	| ?$fpos@U_Mbstatet@@ _last_data_byte
312	| _needs_repack
  	| &lt;alignment member&gt; (size=7)
320	| _timestamp
328	| _timestamp_dirty
329	| _record_timestamp
  	| &lt;alignment member&gt; (size=6)
336	| _scale_factor
344	| _new_scale_factor
352	| _encryption_flag
  	| &lt;alignment member&gt; (size=7)
360	| ?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@ _encryption_password
392	| ?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@ _encryption_algorithm
424	| _encryption_key_length
428	| _encryption_iteration_count
432	| IFileStream _read_file
768	| IStreamWrapper _read_filew
816	| OFileStream _write_file
1144	| FileStream _read_write_file
1488	| StreamWrapper _read_write_filew
1576	| Filename _multifile_name
1664	| ?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@ _header_prefix
1696	| _file_major_ver
1700	| _file_minor_ver
	+---
</code></pre><p>This is the <strong>Multifile</strong> class layout on <strong>MSVC 2019, x64 architecture</strong> as of Feb 27, 2021.</p>
<h4 id="filename-layout">Filename layout</h4>
<pre><code>class Filename	size(88):
	+---
 0	| ?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@ _filename
32	| _dirname_end
40	| _basename_start
48	| _basename_end
56	| _extension_start
64	| _hash_start
72	| _hash_end
80	| _flags
  	| &lt;alignment member&gt; (size=4)
	+---
</code></pre><p>This is the <strong>Filename</strong> class layout on <strong>MSVC 2019, x64 architecture</strong> as of Feb 27, 2021.</p>
<h3 id="proposed-angle-of-approach">Proposed angle of approach</h3>
<p>Our goal is to extract the password of <code>phase_1.ef</code> from the memory of our sample project. We&rsquo;re going to be employing memory scanning, following these steps:</p>
<h4 id="step-one-search-for-all-instances-of-phase_1ef-in-the-memory">Step one: Search for all instances of phase_1.ef in the memory</h4>
<p>Scanning for all instances of <code>phase_1.ef</code> in our process&rsquo;s memory allows us to find all potential <em>Filenames</em> that might have been allocated as the filename of the mounted multifile.</p>
